/*
 * Создать приложение, выводящее n строк с переходом и без перехода на новую строку
 *
 * test comment
 */
package Part_01;

public class AppStr {
	public static void main(String[] args) {
		for(int i = 0; i <= 2; i++) {
			System.out.println("123");
			for(int j = 0; j <= 2; j++) {
				System.out.print("456 ");
			}
		}
	}

}
